bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY261A.xml
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x10" name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x08" name="OCIE0B"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x02" name="TOIE0"/>
                    <bitfield caption="Timer/Counter0 Input Capture Interrupt Enable" mask="0x01" name="TICIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x10" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x08" name="OCF0B"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
                    <bitfield caption="Timer/Counter0 Input Capture Flag" mask="0x01" name="ICF0"/>
                </register>
                <register caption="Timer/Counter Control Register A" name="TCCR0A" offset="0x35" size="1">
                    <bitfield caption="Timer/Counter 0 Width" mask="0x80" name="TCW0"/>
                    <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN0"/>
                    <bitfield caption="Input Capture Noice Canceler" mask="0x20" name="ICNC0"/>
                    <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES0"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x08" name="ACIC0"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x01" name="WGM00"/>
                </register>
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x53" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x10" name="TSM"/>
                    <bitfield caption="Timer/Counter 0 Prescaler Reset" mask="0x08" name="PSR0"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0 High" name="TCNT0H" offset="0x34" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Low" name="TCNT0L" offset="0x52" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x33" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x32" size="1" mask="0xFF"/>
            </register-group>
            <register-group caption="Timer/Counter, 8-bit" name="TC1">
                <register caption="Timer/Counter Control Register A" name="TCCR1A" offset="0x50" size="1">
                    <bitfield caption="Compare Output Mode, Bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode, Bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Force Output Compare Match 1A" mask="0x08" name="FOC1A"/>
                    <bitfield caption="Force Output Compare Match 1B" mask="0x04" name="FOC1B"/>
                    <bitfield caption="Pulse Width Modulator Enable" mask="0x02" name="PWM1A"/>
                    <bitfield caption="Pulse Width Modulator Enable" mask="0x01" name="PWM1B"/>
                </register>
                <register caption="Timer/Counter Control Register B" name="TCCR1B" offset="0x4F" size="1">
                    <bitfield caption="PWM Inversion Mode" mask="0x80" name="PWM1X"/>
                    <bitfield caption="Timer/Counter 1 Prescaler reset" mask="0x40" name="PSR1"/>
                    <bitfield caption="Dead Time Prescaler" mask="0x30" name="DTPS1" values="MISC_2BIT_SCALE"/>
                    <bitfield caption="Clock Select Bits" mask="0x0F" name="CS1" values="CLK_SEL_4BIT"/>
                </register>
                <register caption="Timer/Counter Control Register C" name="TCCR1C" offset="0x47" size="1">
                    <bitfield caption="COM1A1 Shadow Bit" mask="0x80" name="COM1A1S"/>
                    <bitfield caption="COM1A0 Shadow Bit" mask="0x40" name="COM1A0S"/>
                    <bitfield caption="COM1B1 Shadow Bit" mask="0x20" name="COM1B1S"/>
                    <bitfield caption="COM1B0 Shadow Bit" mask="0x10" name="COM1B0S"/>
                    <bitfield caption="Comparator D output mode" mask="0x0C" name="COM1D"/>
                    <bitfield caption="Force Output Compare Match 1D" mask="0x02" name="FOC1D"/>
                    <bitfield caption="Pulse Width Modulator D Enable" mask="0x01" name="PWM1D"/>
                </register>
                <register caption="Timer/Counter Control Register D" name="TCCR1D" offset="0x46" size="1">
                    <bitfield caption="Fault Protection Interrupt Enable" mask="0x80" name="FPIE1"/>
                    <bitfield caption="Fault Protection Mode Enable" mask="0x40" name="FPEN1"/>
                    <bitfield caption="Fault Protection Noise Canceler" mask="0x20" name="FPNC1"/>
                    <bitfield caption="Fault Protection Edge Select" mask="0x10" name="FPES1"/>
                    <bitfield caption="Fault Protection Analog Comparator Enable" mask="0x08" name="FPAC1"/>
                    <bitfield caption="Fault Protection Interrupt Flag" mask="0x04" name="FPF1"/>
                    <bitfield caption="Waveform Generation Mode Bit" mask="0x03" name="WGM1" values="PULSE_WIDTH_MODU2"/>
                </register>
                <register caption="Timer/Counter1 Control Register E" name="TCCR1E" offset="0x20" size="1">
                    <bitfield caption="Ouput Compare Override Enable Bits" mask="0x3F" name="OC1OE"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT1" offset="0x4E" size="1" mask="0xFF" ocd-rw="R"/>
