bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY261A.xml
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="PDIP_SOIC_TSSOP_20">
            <pin position="1" pad="PB0"/>
            <pin position="2" pad="PB1"/>
            <pin position="3" pad="PB2"/>
            <pin position="4" pad="PB3"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="PB4"/>
            <pin position="8" pad="PB5"/>
            <pin position="9" pad="PB6"/>
            <pin position="10" pad="PB7"/>
            <pin position="11" pad="PA7"/>
            <pin position="12" pad="PA6"/>
            <pin position="13" pad="PA5"/>
            <pin position="14" pad="PA4"/>
            <pin position="15" pad="AVCC"/>
            <pin position="16" pad="AGND"/>
            <pin position="17" pad="PA3"/>
            <pin position="18" pad="PA2"/>
            <pin position="19" pad="PA1"/>
            <pin position="20" pad="VA0"/>
        </pinout>
        <pinout name="QFN32">
            <pin position="1" pad="NC"/>
            <pin position="2" pad="PB3"/>
            <pin position="3" pad="NC"/>
            <pin position="4" pad="VCC"/>
            <pin position="5" pad="GND"/>
            <pin position="6" pad="NC"/>
            <pin position="7" pad="PB4"/>
            <pin position="8" pad="PB5"/>
            <pin position="9" pad="NC"/>
            <pin position="10" pad="PB6"/>
            <pin position="11" pad="PB7"/>
            <pin position="12" pad="NC"/>
            <pin position="13" pad="PA7"/>
            <pin position="14" pad="PA6"/>
            <pin position="15" pad="PA5"/>
            <pin position="16" pad="NC"/>
            <pin position="17" pad="PA4"/>
            <pin position="18" pad="AVCC"/>
            <pin position="19" pad="NC"/>
            <pin position="20" pad="NC"/>
            <pin position="21" pad="AGND"/>
            <pin position="22" pad="PA3"/>
            <pin position="23" pad="PA2"/>
            <pin position="24" pad="NC"/>
            <pin position="25" pad="PA1"/>
            <pin position="26" pad="PA0"/>
            <pin position="27" pad="NC"/>
            <pin position="28" pad="NC"/>
            <pin position="29" pad="NC"/>
            <pin position="30" pad="PB0"/>
            <pin position="31" pad="PB1"/>
            <pin position="32" pad="PB2"/>
        </pinout>
    </pinouts>
</target-description-file>
